LonelyWolf/stm32/bike-computer/main.c
///////////////////
// STM32L151RBT6 //
///////////////////


/////////////////////////////////////////////////////////////////////////

#define DEBUG

/////////////////////////////////////////////////////////////////////////


#include <misc.h>
#include <stm32l1xx_rcc.h>
#include <stm32l1xx_gpio.h>
#include <stm32l1xx_rtc.h>
#include <stm32l1xx_exti.h>
#include <stm32l1xx_tim.h>
#include <stm32l1xx_usart.h>
#include <stm32l1xx_syscfg.h>
#include <stm32l1xx_dma.h>
#include <string.h> // For memset, memmove

#include <delay.h>
#include <spi.h>
#include <i2c.h>
#include <uart.h>
#include <uc1701.h>
#include <nRF24.h>
#include <bmp180.h>
#include <RTC.h>
#include <wolk.h>
#include <GUI.h>
#include <GPS.h>
#include <beeper.h>

#include <font5x7.h>
#include <font7x10.h>
#include <resources.h>


/////////////////////////////////////////////////////////////////////////


#define SCREENSAVER_TIMEOUT            600  // Timeout for screensaver activation (seconds)
#define ALT_MEASURE_DUTY_CYCLE          30  // Temperature/pressure measurement duty cycle (seconds)
#define NO_SIGNAL_TIME                  10  // Sensor signal timeout (seconds)

uint8_t nRF24_RX_Buf[nRF24_RX_PAYLOAD];     // nRF24L01 payload buffer

bool _new_packet;                           // TRUE if new packet was received but not parsed
bool _new_time;                             // TRUE if time was updated
bool _bmp180_present;                       // TRUE if BMP180 sensor responded on I2C bus
bool _RF_icon;                              // Flag for RF icon flashing

uint16_t _prev_cntr_SPD;                    // Last received cntr_SPD value
uint16_t _prev_tim_SPD;                     // Last received tim_SPD value
uint16_t _tim_excess;                       // Timer excess from 1 second ratio
uint32_t _cntr_cadence;                     // Cadence counter (for AVG calculation)
uint32_t _cadence_accum;                    // Cadence accumulator (for AVG calculation)

int16_t altitude_history[128];              // Last 128 altitude values
uint8_t _altitude_duty_cycle;               // Altitude measurement duty cycle

uint16_t _DMA_cntr;                         // Last value of UART RX DMA counter (to track RX timeout)

uint32_t i;                                 // THIS IS UNIVERSAL VARIABLE
uint32_t ccc;                               // Wake-ups count, for debug purposes


/////////////////////////////////////////////////////////////////////////


void ParsePacket(void);
void ParseGPS(void);
bool UpdateBMP180(void);


/////////////////////////////////////////////////////////////////////////


void InitPeripherals(void) {
	GPIO_InitTypeDef PORT;
	NVIC_InitTypeDef NVICInit;
	EXTI_InitTypeDef EXTIInit;

	// Configure GPIO
	// Enable PORTA and PORTC peripheral
	RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOA | RCC_AHBPeriph_GPIOC,ENABLE);
	// Charge STAT pin (PA15)
	PORT.GPIO_Mode  = GPIO_Mode_IN;
	PORT.GPIO_Speed = GPIO_Speed_2MHz;
	PORT.GPIO_PuPd  = GPIO_PuPd_UP;
	PORT.GPIO_Pin   = GPIO_Pin_15;
	GPIO_Init(GPIOA,&PORT);

	// BTN1 pin (PA5)
	PORT.GPIO_Mode = GPIO_Mode_IN;
	PORT.GPIO_PuPd = GPIO_PuPd_UP;
	PORT.GPIO_Pin  = BTN1_PIN;
	GPIO_Init(BTN1_PORT,&PORT);
	// BTN2 pin (PA7)
	PORT.GPIO_Pin  = BTN2_PIN;
	GPIO_Init(BTN2_PORT,&PORT);
	// BTN3 pin (PC10)
	PORT.GPIO_Pin  = BTN3_PIN;
	GPIO_Init(BTN3_PORT,&PORT);
	// BTN4 pin (PC11)
	PORT.GPIO_Pin  = BTN4_PIN;
	GPIO_Init(BTN4_PORT,&PORT);

	// Initialize buzzer out
	BEEPER_Init();

	// Initialize delay timer without callback function
	Delay_Init(NULL);

	// UART port initialization
	UART2_Init(115200);

	// Configure basic timer TIM7 (for DMA timeout)
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM7,ENABLE); // Enable TIMx peripheral
	TIM7->CR1  |= TIM_CR1_ARPE; // Auto-preload enable
	TIM7->PSC   = SystemCoreClock / 20000; // prescaler
	TIM7->ARR   = 999; // auto reload value
	TIM7->EGR   = 1; // Generate an update event to reload the prescaler value immediately
	TIM7->DIER |= TIM_DIER_UIE; // Enable TIMx interrupt
	// TIM7 IRQ
	NVICInit.NVIC_IRQChannel = TIM7_IRQn;
	NVICInit.NVIC_IRQChannelCmd = ENABLE;
	NVICInit.NVIC_IRQChannelPreemptionPriority = 0x05; // below middle priority
	NVICInit.NVIC_IRQChannelSubPriority = 0x05; // below middle priority
	NVIC_Init(&NVICInit);

	// SPI2 port initialization
	SPI2_Init();

    // External interrupts
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_SYSCFG,ENABLE); // Enable the system configuration controller

	// PC6 -> EXTI line 6 (nRF24L01 IRQ)
	SYSCFG_EXTILineConfig(EXTI_PortSourceGPIOC,EXTI_PinSource6);
	// Configure EXTI on Line6
	EXTIInit.EXTI_Line = EXTI_Line6;              // EXTI will be on line 6
	EXTIInit.EXTI_Mode = EXTI_Mode_Interrupt;     // Generate IRQ
	EXTIInit.EXTI_Trigger = EXTI_Trigger_Falling; // IRQ on edge fall
	EXTIInit.EXTI_LineCmd = ENABLE;
	EXTI_Init(&EXTIInit);

	// Configure EXTI9_5 interrupt
	NVICInit.NVIC_IRQChannel = EXTI9_5_IRQn;
	NVICInit.NVIC_IRQChannelCmd = ENABLE;
	NVICInit.NVIC_IRQChannelPreemptionPriority = 0x01; // 1 - highest priority
	NVICInit.NVIC_IRQChannelSubPriority = 0x01;
	NVIC_Init(&NVICInit);

	// Configure EXTI15_10 interrupt
	NVICInit.NVIC_IRQChannel = EXTI15_10_IRQn;
	NVIC_Init(&NVICInit);

	// PA5 -> EXTI line 5 (Button#1)
	SYSCFG_EXTILineConfig(EXTI_PortSourceGPIOA,EXTI_PinSource5);
	// Configure EXTI on Line5
	EXTIInit.EXTI_Line = EXTI_Line5;              // EXTI will be on line 5
	EXTIInit.EXTI_Mode = EXTI_Mode_Interrupt;     // Generate IRQ
	EXTIInit.EXTI_Trigger = EXTI_Trigger_Rising_Falling; // IRQ on edge fall
	EXTIInit.EXTI_LineCmd = ENABLE;
	EXTI_Init(&EXTIInit);

	// PA7 -> EXTI line 7  (Button#2)
	SYSCFG_EXTILineConfig(EXTI_PortSourceGPIOA,EXTI_PinSource7);
	// Configure EXTI on Line7
	EXTIInit.EXTI_Line = EXTI_Line7;              // EXTI will be on line 7
	EXTI_Init(&EXTIInit);

	// PC10 -> EXTI line 10  (Button#3)
	SYSCFG_EXTILineConfig(EXTI_PortSourceGPIOC,EXTI_PinSource10);
	// Configure EXTI on Line10
	EXTIInit.EXTI_Line = EXTI_Line10;             // EXTI will be on line 10
	EXTI_Init(&EXTIInit);

	// PC10 -> EXTI line 11  (Button#4)
	SYSCFG_EXTILineConfig(EXTI_PortSourceGPIOC,EXTI_PinSource11);
	// Configure EXTI on Line11
	EXTIInit.EXTI_Line = EXTI_Line11;             // EXTI will be on line 11
	EXTI_Init(&EXTIInit);

