LonelyWolf/stm32/bike-computer/main.c
// Update data from BMP180
// return: TRUE if data acquired successfully, FALSE otherwise
// note: really slow routine
bool UpdateBMP180(void) {
	bool result = FALSE;
	int16_t _raw_temp;
	int32_t _raw_press;

	if (_bmp180_present) {
		if (BMP180_GetReadings(&_raw_temp,&_raw_press,BMP180_UHIRES)) {  // <--- UHIRES mode takes about 28ms
//		if (BMP180_GetReadings(&_raw_temp,&_raw_press,BMP180_ADVRES)) {  // <--- ADVRES mode takes about 80ms
			CurData.Temperature = _raw_temp;
			if (CurData.Temperature > CurData.MaxTemperature) CurData.MaxTemperature = CurData.Temperature;
			if (CurData.Temperature < CurData.MinTemperature) CurData.MinTemperature = CurData.Temperature;

			CurData.Pressure = _raw_press;
			if (CurData.Pressure > CurData.MaxPressure) CurData.MaxPressure = CurData.Pressure;
			if (CurData.Pressure < CurData.MinPressure) CurData.MinPressure = CurData.Pressure;

			CurData.Altitude = BMP180_hPa_to_Altitude(CurData.Pressure);
			if (CurData.Altitude > CurData.MaxAltitude) CurData.MaxAltitude = CurData.Altitude;
			if (CurData.Altitude < CurData.MinAltitude) CurData.MinAltitude = CurData.Altitude;

			memmove(&altitude_history[1],&altitude_history[0],sizeof(altitude_history) - sizeof(*altitude_history));
			altitude_history[0] = CurData.Altitude;

			// Reset this counter only if readings obtained successfully, otherwise next try will be on next cycle
			_altitude_duty_cycle = 0;

			GUI_new_BMP180 = TRUE;
			result = TRUE;
		}
	}
	return result;
}


/////////////////////////////////////////////////////////////////////////


int main(void) {
	// Update SystemCoreClock according to Clock Register Values
	SystemCoreClockUpdate();

#ifdef DEBUG
	// Enable debugging when the MCU is in low power modes
	DBGMCU->CR |= DBGMCU_CR_DBG_SLEEP | DBGMCU_CR_DBG_STOP | DBGMCU_CR_DBG_STANDBY;
#endif

/////////////////////////////////////////////////////////////////////////
//  Boot section
/////////////////////////////////////////////////////////////////////////

	// Variables initialization ------------------------------
	memset(&nRF24_RX_Buf,0,nRF24_RX_PAYLOAD);
	memset(&nRF24_Packet,0,sizeof(nRF24_Packet));
	memset(&CurData,0,sizeof(CurData));
	memset(&altitude_history,0,sizeof(altitude_history));
	memset(&GPS_buf,0,sizeof(GPS_buf));
	memset(&USART_FIFO,0,FIFO_BUFFER_SIZE);
	GPS_InitData();

	_new_packet     = FALSE;
	_new_time       = FALSE;
	_screensaver    = FALSE;
	_bmp180_present = FALSE;
	_RF_icon        = TRUE;
	GPS_new_data    = FALSE;
	GPS_buf_cntr    = 0;
	_DMA_cntr       = 0;
	_prev_cntr_SPD  = 0;
	_prev_tim_SPD   = 0;
	_tim_excess     = 0;
	_cntr_cadence   = 0;
	_cadence_accum  = 0;
	_no_signal_time = 32768;
	_idle_time      = 0;
	_altitude_duty_cycle = ALT_MEASURE_DUTY_CYCLE + 1;
	CurData.MinGPSAlt = 0x7FFFFFFF; // LONG_MAX - first time when altitude will be acquired it becomes normal value

	// Buttons initialization
	for (i = 0; i < 4; i++) memset(&BTN[i],0,sizeof(BTN[i]));
	BTN[0].PORT = BTN1_PORT;
	BTN[0].PIN  = BTN1_PIN;
	BTN[1].PORT = BTN2_PORT;
	BTN[1].PIN  = BTN2_PIN;
	BTN[2].PORT = BTN3_PORT;
	BTN[2].PIN  = BTN3_PIN;
	BTN[3].PORT = BTN4_PORT;
	BTN[3].PIN  = BTN4_PIN;

	// These values stored in EEPROM
	Settings.GMT_offset = 3;
	Settings.WheelCircumference = 206;
	Settings.altitude_home = 178;
	Settings.LCD_brightness = 50;
	Settings.LCD_timeout = 30;

	// Read settings from EEPROM
	ReadSettings_EEPROM();

	// -------------------- end of variables initialization

	InitPeripherals();

	// Display initialization
	// Pinout:
	//   PB7  -> CS
	//   PB8  -> RST
	//   PB9  -> RS
	//   PB13 -> SCK (SPI SCK)
	//   PB15 -> SDA (SPI MOSI)
	//   PA1  -> LEDA (Backlight LED anode)
	Display_Init();
	UC1701_Fill(0x00);
	GUI_DrawBitmap(98,39,30,25,&bmp_bike_man[0]);

	// Boot screen
	PutStr(0,0,"Wolk bike computer:",fnt5x7);
	PutStr(0,42,"CPU:",fnt5x7);
	i = 24 + PutIntF(24,42,SystemCoreClock / 1000,3,fnt5x7);
	PutStr(i,42,"MHz",fnt5x7);
	UC1701_Flush();

	PutStr(0,56,"STAT:",fnt5x7);
	PutStr(30,56,GPIO_ReadInputDataBit(GPIOA,GPIO_Pin_15) == Bit_RESET ? "0" : "1",fnt5x7);

	// Init the RTC and configure it clock to LSE
	PutStr(0,8,"LSE:",fnt5x7);
	UC1701_Flush();
	RTC_Config();
	PutStr(24,8,"Ok",fnt5x7);
	UC1701_Flush();

	// Configure nRF24L01+
    // Pinout:
    //   PC7  -> CE
    //   PB12 -> CS
    //   PB13 -> SCK
    //   PB15 -> MOSI
    //   PB14 <- MISO
    //   PC6  <- IRQ
	PutStr(0,16,"nRF24L01:",fnt5x7);
	UC1701_Flush();
    nRF24_init();
    if (nRF24_Check()) {
    	nRF24_SetRXMode();
    	PutStr(54,16,"Ok",fnt5x7);
    	UC1701_Flush();
    } else {
    	PutStr(54,16,"Fail",fnt5x7);
        UC1701_Flush();
    	while(1);
    }

    // I2C2 port initialization
    PutStr(0,24,"BMP180:",fnt5x7);
    UC1701_Flush();
    // I2C fast mode (400kHz)
    if (I2C2_Init(400000) == I2C_SUCCESS) {
        BMP180_Reset(); // Send reset command to BMP180
        Delay_ms(15); // Wait for BMP180 startup time (10ms by datasheet)
        if (BMP180_Check() == BMP180_SUCCESS) {
    		_bmp180_present = TRUE;
    		PutChar(42,24,'v',fnt5x7);
    		i = BMP180_GetVersion();
    		PutInt(48,24,i,fnt5x7);
    		BMP180_ReadCalibration();
			CurData.MinTemperature =  32767;
			CurData.MaxTemperature = -32767;
			CurData.MinPressure = 2147483647; // LONG_MAX - it becomes normal when the pressure will be acquired normally first time
    		if (UpdateBMP180()) {
        		GUI_PutTemperature(60,24,CurData.Temperature,fnt5x7);
        		GUI_PutPressure(60,32,CurData.Pressure,PT_mmHg,fnt5x7);
        		altitude_history[0] = BMP180_hPa_to_Altitude(CurData.Pressure);
    		} else {
    			PutStr(60,24,"Readings",fnt5x7);
    			PutStr(60,32,"failed",fnt5x7);
    		}
    	} else {
    		PutStr(42,24,"Not present",fnt5x7);
    	}
    } else {
    	PutStr(42,24,"I2C timeout",fnt5x7);
    }
	UC1701_Flush();

	BEEPER_Enable(1500,15);
//	Delay_ms(2500); // Fancy startup delay

	UC1701_Fill(0x00);
    UC1701_Flush();

	// Set custom time for debug purposes
	RTC_Time.RTC_Hours   = 23;
	RTC_Time.RTC_Minutes = 58;
	RTC_Time.RTC_Seconds = 51;
	RTC_Date.RTC_Date    = 16;
	RTC_Date.RTC_Month   = 04;
	RTC_Date.RTC_Year    = 14;
	RTC_Date.RTC_WeekDay = 3;
	RTC_SetDateTime();

