LonelyWolf/stm32/bike-computer/main.c
//	GPS_SendCommand("$PMTK104*"); // Reset EB500 to factory settings
//	GPS_SendCommand("$PMTK314,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1*"); // All sentences
//	GPS_SendCommand("$PMTK314,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0*"); // GLL
//	GPS_SendCommand("$PMTK314,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0*"); // RMC
//	GPS_SendCommand("$PMTK314,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0*"); // VTG
//	GPS_SendCommand("$PMTK314,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0*"); // GGA
//	GPS_SendCommand("$PMTK314,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0*"); // GSA
//	GPS_SendCommand("$PMTK314,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0*"); // GSV
//	GPS_SendCommand("$PMTK314,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0*"); // ZDA
	GPS_SendCommand("$PMTK314,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,1,0*"); // All supported sentences
	GPS_SendCommand("$PMTK101*"); // Hot restart

	ccc = 0;

	// Reinitialize delay timer with callback function
	Delay_Init(callback_Delay);

	// Configure wake-up timer to wake every second and enable it
	RTC_SetWakeUp(1);


/////////////////////////////////////////////////////////////////////////
//	Main loop
/////////////////////////////////////////////////////////////////////////

	while(1) {
		if (_screensaver) {
			RTC_SetWakeUp(60); // Wake once per minute
			nRF24_Sleep(); // Turn off transceiver
			UC1701_SetBacklight(0);

			GUI_ScreenSaver();

 			// Reinitialize display
 			Display_Init();
			UC1701_Fill(0x00);

			nRF24_SetRXMode(); // Turn on transceiver in RX mode
 			RTC_SetWakeUp(1); // Wake every second

			GUI_refresh = TRUE;
		}

		if (_new_packet) {
			_new_packet = FALSE;
			_RF_icon = !_RF_icon;
			GUI_refresh = TRUE;
		}

		if (GPS_new_data) {
			if (GPSData.datetime_valid && _new_time) {
				if (RTC_Time.RTC_Minutes != (GPSData.time / 60) % 60) {
					// Date and time obtained from GPS
					RTC_Time.RTC_Hours   =  GPSData.time / 3600;
					RTC_Time.RTC_Minutes = (GPSData.time / 60) % 60;
					RTC_Time.RTC_Seconds =  GPSData.time % 60;
					i = GPSData.date / 1000000;
					RTC_Date.RTC_Date  = i;
					RTC_Date.RTC_Month = (GPSData.date - (i * 1000000)) / 10000;
					RTC_Date.RTC_Year  = (GPSData.date % 10000) - 2000;
					RTC_AdjustTimeZone(&RTC_Time,&RTC_Date,Settings.GMT_offset);
					RTC_SetDateTime();
				}
			}
			GPSData.datetime_valid = FALSE;
			GPSData.time_valid = FALSE;
			GPS_new_data = FALSE;
			GUI_refresh = TRUE;
		}

		if (_new_time) {
			GUI_refresh = TRUE;
			_new_time = FALSE;
		}

		if (GUI_refresh) {
			UC1701_Fill(0x00);
			GUI_DrawSpeed(scr_width - 55,0,CurData.Speed,CurData.AvgSpeed);

			HLine(0,scr_width - 1,scr_height - 29,PSet);
			VLine(67,0,scr_height - 1,PSet);

			// RF icon
			if (_no_signal_time > NO_SIGNAL_TIME)
				GUI_DrawBitmap(0,0,13,7,&bmp_icon_13x7[65]);
			else if (_RF_icon) {
				GUI_DrawBitmap(0,0,13,7,&bmp_icon_13x7[39]);
			} else {
				GUI_DrawBitmap(0,0,13,7,&bmp_icon_13x7[52]);
			}

			// GPS icon
			if (GPSData.fix != 2 && GPSData.fix != 3)
				GUI_DrawBitmap(16,0,13,7,&bmp_icon_13x7[26]);
			else if (GPSData.fix == 2) GUI_DrawBitmap(16,0,13,7,&bmp_icon_13x7[0]);
			else GUI_DrawBitmap(16,0,13,7,&bmp_icon_13x7[13]);

			PutStr(scr_width - 30,scr_height - 27,"CDC",fnt5x7);
			if (_no_signal_time > NO_SIGNAL_TIME) {
				for (i = 0; i < 3; i++)	FillRect(scr_width - (i * 10) - 15,scr_height - 3,scr_width - (i * 10) - 7,scr_height - 1,PSet);
			} else {
				GUI_DrawNumber(-scr_width + 7,-scr_height + 1,CurData.Cadence,0,DS_Small);
			}
			GUI_DrawBitmap(scr_width - 5,scr_height - 19,5,19,&small_signs[15]);

			PutStr(3,scr_height - 27,"Ride Time",fnt5x7);
			GUI_DrawRideTime(0,scr_height - 19,CurData.TripTime);

			GUI_PutPressure(0,26,CurData.Pressure,PT_mmHg,fnt5x7);
			GUI_PutTemperature(0,18,CurData.Temperature,fnt5x7);

			GUI_PutTimeSec(0,10,RTC_Time.RTC_Hours * 3600 + RTC_Time.RTC_Minutes * 60 + RTC_Time.RTC_Seconds,fnt5x7);

			ccc++;
	/*
			i = PutInt(3,3,ccc,fnt5x7);
			Rect(0,0,i + 4,12,PReset);
			Rect(1,1,i + 3,11,PSet);
			Rect(2,2,i + 2,10,PReset);
	*/

			UC1701_Flush();
			GUI_refresh = FALSE;
		}

		// "Up" button pressed - just clear the counter, there is no function yet
		if (BTN[BTN_UP].cntr > 0) {
			BTN[BTN_UP].cntr = 0;
		}

		// "Down" button pressed - just clear the counter, there is no function yet
		if (BTN[BTN_DOWN].cntr > 0) {
			BTN[BTN_DOWN].cntr = 0;
		}

		// "Enter" button hold - show main menu
		if (BTN[BTN_ENTER].state == BTN_Hold || BTN[BTN_ENTER].cntr) {
			GUI_MainMenu();
		}

		// "Escape" button pressed - just clear the counter, there is no function for yet
		if (BTN[BTN_ESCAPE].cntr) {
			BTN[BTN_ESCAPE].cntr = 0;
		}

		SleepWait(); // Sleep mode
	}

	// Something awful will happen when you reach this point
}
